Public Attributes | List of all members
ACAPI::MEP::PipeBranchPreferenceTable::Key Struct Reference
MEP Element Manager
The key that uniquely identifies a row in the PipeBranchPreferenceTable. More...
#include <MEPPipeBranchPreferenceTable.hpp>
 Public Attributes
 uint32_t  | mainAxisReferenceId
The main axis referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
 double  | branchAxisAngle
The branch axis angle of the row. The table only contains the angles that are defined in the PipeAngleSet. Needs to be between [1, 90] degrees.
 uint32_t  | branchAxisReferenceId
The branch axis referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Detailed Description
The key that uniquely identifies a row in the PipeBranchPreferenceTable.
Since
Archicad 29